#+TITLE: Demo of the "ident" package 
# TODO: try frequency domain toolbox
#+PROPERTY: eval export
#+PROPERTY: exports both
#+PROPERTY: noweb eval
#+PROPERTY: tangle "demo.m"
#+PROPERTY: session *MATLAB*


* Equivalence with PEM in the OE case

#+BEGIN_SRC matlab
%% simulation parameters
clear all, randn('seed', 0), rand('seed', 0), warning off
m = 1; p = 1; ell = 2; T = 300; s = 0.1;     
opt_oe.exct = 1:m; % fixed inputs = output error identification
opt_eiv.exct = []; % errors-in-variables setup 

%% generate data
n = ell * p; q = m + p; sys0 = drss(n, p, m); % random "true" system
u0 = rand(T, m); xini0 = rand(n, 1);          % random "true" trajectory
y0 = lsim(sys0, u0, [], xini0); u = u0;       
yt = randn(T, p); y = y0 + s * norm(y0) * yt / norm(yt); % output error
w0 = [u0 y0]; w = [u y];

%% compare ident and pem
tic, sysh_ident = ident(w, m, ell, opt_oe); t_ident = toc;
tic, sysh_pem = pem(iddata(y, u), n); t_pem = toc;
[Yh, M] = compare(iddata(y, u), idss(sysh_ident), sysh_pem); 
ans = [[mean(M{1}); mean(M{2})] [t_ident; t_pem]]
#+END_SRC

#+RESULTS:
| 86.831 | 0.39396 |
| 86.806 |  6.2899 |

* Permutation of variables 

#+BEGIN_SRC matlab
%% the model for [y u] is the inverse of the model for [u y]
sysh1 = ident(w, m, ell, opt_eiv);
sysh2 = ident(fliplr(w), m, ell, opt_eiv);
ans = [eig(sysh1) eig(inv(sysh2))]
#+END_SRC

#+RESULTS:
| 0.01129 | 0.011284 |
| 0.69769 |  0.69767 |

* Unstable system

- noisy data
  #+BEGIN_SRC matlab
  %% the model for the reversed time data has reciprocal poles
  sysh3 = ident(flipud(w), m, ell, opt_eiv); 
  ans = [sort(1 ./ (eig(sysh1))) eig(sysh3)]
  #+END_SRC

  #+RESULTS:
  |  1.433 |  1.433 |
  | 88.573 | 88.566 |

- exact data
  #+BEGIN_SRC matlab
  %% pem fails to identify unstable model
  sysh_ident = ident(flipud(w0), m, ell, opt_oe); % note that now we use the true data w0
  opt_pem = ssestOptions; opt_pem.Advanced.StabilityThreshold.z = inf; % disable the stability constraint
  try 
    sysh_pem = pem(iddata(flipud(y0), flipud(u0)), n, opt_pem, 'dist', 'none');
  catch
    sysh_pem = zeros(n); % zero indicates failure 
  end
  ans = [sort(1 ./ eig(sys0)) eig(sysh_ident) sort(eig(sysh_pem))]
  #+END_SRC

  #+RESULTS:
  |  1.510 |  1.510 | 0 |
  | 25.751 | 25.751 | 0 |

* Trajectory of minimal length

#+BEGIN_SRC matlab
%% pem needs more data to identify a model
Tmin = ell + q * (ell + 1) - 1; TT = (Tmin - 1):15; np = length(TT);
work_ident = zeros(1, np); correct_ident = zeros(1, np); 
work_pem   = zeros(1, np); correct_pem   = zeros(1, np);
for i = 1:np
  try 
    sysh_ident = ident(w0(1:TT(i), :), m, ell, opt_oe); work_ident(i) = 1; 
    correct_ident(i) = norm(sys0 - sysh_ident) < 1e-5; 
  end
  try 
    sysh_pem = pem(iddata(y0(1:TT(i), :), u0(1:TT(i), :)), n, 'dist', 'none'); work_pem(i) = 1; 
    correct_pem(i) = norm(sys0 - sysh_pem) < 1e-5; 
  end
end 
ans = [TT; work_ident; correct_ident; work_pem; correct_pem]
#+END_SRC

#+RESULTS:
| 6 | 7 | 8 | 9 | 10 | 11 | 12 | 13 | 14 | 15 |
| 0 | 0 | 1 | 1 |  1 |  1 |  1 |  1 |  1 |  1 |
| 0 | 0 | 1 | 1 |  1 |  1 |  1 |  1 |  1 |  1 |
| 0 | 0 | 0 | 0 |  0 |  0 |  0 |  1 |  1 |  1 |
| 0 | 0 | 0 | 0 |  0 |  0 |  0 |  1 |  1 |  1 |

* Multiple short trajectories

#+BEGIN_SRC matlab
%% N short trajectories equivalent to one long trajectory (N * Tshort = T)
Tshort = 13; N = round(T / Tshort); 
u_mult = {}; y_mult = {}; w_mult = []; 
for k = 1:N,
  u0 = rand(Tshort, m); xini0 = rand(n, 1); 
  y0 = lsim(sys0, u0, [], xini0); 
  yt = randn(Tshort, p); y_mult{k} = y0 + s * norm(y0) * yt / norm(yt); 
  u_mult{k} = u0; w_mult(:, :, k) = [u0 y_mult{k}]; 
end
tic, sysh = ident(w_mult, m, ell, opt_oe); t_ident = toc;
tic, sysh_pem = pem(iddata(y_mult, u_mult), n, 'dist', 'none'); t_pem = toc;
[Yh, M] = compare(iddata(y_mult, u_mult), idss(sysh), sysh_pem); 
ans = [[mean(M{1}); mean(M{2})] [t_ident; t_pem]]
#+END_SRC

#+RESULTS:
| 88.303 | 0.0083 |
| 88.462 | 1.1033 |

* Missing data 

#+BEGIN_SRC matlab
%% randomly distributed missing data in time and variables
Tp = 100; Im = randperm(q * Tp); Tm = round(0.2 * q * Tp); 
wm = w(1:Tp, :); wm(Im(1:Tm)) = NaN; um = wm(:, 1:m); ym = wm(:, m + 1:end);

%% use misdata for the comparison
tic, sysh_n4sid = ss(n4sid(misdata(iddata(ym, um), 10), n, 'dist', 'none')); t_n4sid = toc;
tic, opt_oe.sys0 = sysh_n4sid; sysh_ident = ident(wm, m, ell, opt_oe); t_ident = toc; opt_oe.sys0 = []; 
tic, sysh_pem = pem(misdata(iddata(ym, um), 10), sysh_n4sid, 'dist', 'none'); t_pem = toc;
[Yh, M] = compare(iddata(y0, u0), sysh_n4sid, idss(sysh_ident), sysh_pem); 
ans = [[mean(M{1}); mean(M{2}); mean(M{3})] [t_n4sid; t_ident; t_pem]]
#+END_SRC

#+RESULTS:
| 58.51 | 6.8132 |
| 83.93 | 0.0726 |
| 60.36 | 7.3597 |

# addpath /home/im/mfiles/missing-data-dynamic/simio/ % replace 
# tic, sysh_nn = nucnrm_md(ym, um, n); t_nn = toc; % Liu, Hansson, Vandenberghe, 2013

